DataProcessors/ТранспортныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТранспортныеЕдиницы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СписокТранспортныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СписокТранспортныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокументаОформление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаПТУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортнаяЕдиница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТранспортныеЕдиницы/Forms/ФормаТранспортныхЕдиниц/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//+Сёмин Р. 23.12.2025 #UT10-5593
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(, "Ошибка: " + КодОшибки + ", " + ТекстОшибки);
		
	КонецЕсли;	
	
	ЗагрузитьТранспортныеЕдиницы();
	
	Элементы.СписокТранспортныхЕдиниц.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	//-Сёмин Р. 23.12.2025 #UT10-5593
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+Сёмин Р. 22.12.2025 #UT10-5593
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокТранспортныхЕдиниц");
	
	УстановитьОтборВСписке();
	//-Сёмин Р. 22.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//+Сёмин Р. 22.12.2025 #UT10-5593
	Штрихкод = "";
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
			
		КонецЕсли; 
		
		Штрихкод = Результат.Штрихкод;
		
	ИначеЕсли Событие = "ClipboardEvent" ИЛИ Событие = "Вручную" Тогда
		Штрихкод = Данные;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		
		СтруктураДанных = ПоискТЕПоШКНаСервере(Штрихкод);
		
		Если ЗначениеЗаполнено(СтруктураДанных.СсылкаПТУ) Тогда
			
			Если СтруктураДанных.СтатусПриемки = "В пути" Тогда
				
				Оповещение = Новый ОписаниеОповещения("ПровестиДокументыПТУ", ЭтотОбъект, СтруктураДанных);
				ТекстВопроса = СтруктураДанных.ТекстСообщения + Символы.ПС + Символы.ПС + "Подтвердить поступление на склад документа" +
					Символы.ПС + "ПТУ № " + СокрЛП(СтруктураДанных.НомерСкладскогоДокумента) + Символы.ПС + "по контрагенту " + СокрЛП(СтруктураДанных.Контрагент) + "?";
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") И ВладелецФормы.ИмяФормы = "Обработка.ПриемкаКоллективная.Форма.ФормаСпискаПТУ" Тогда
					
					Оповещение = Новый ОписаниеОповещения("ОткрытьДокументПТУ", ЭтотОбъект, СтруктураДанных);
					ТекстВопроса = СтруктураДанных.ТекстСообщения + Символы.ПС + Символы.ПС + "Открыть ПТУ № " + СокрЛП(СтруктураДанных.НомерСкладскогоДокумента) + Символы.ПС + "по контрагенту " + СокрЛП(СтруктураДанных.Контрагент) + "?";
					ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
					
				Иначе
					Сообщить("ПТУ № " + СокрЛП(СтруктураДанных.НомерСкладскогоДокумента) + " уже на складе." + Символы.ПС + "Перейдите в раздел Приемка");
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			Сообщить(СтруктураДанных.ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	//-Сёмин Р. 22.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//+Сёмин Р. 24.12.2025 #UT10-5593
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокТранспортныхЕдиниц.Обновить();
	КонецЕсли;
	//-Сёмин Р. 24.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТранспортныеЕдиницы()
	
	//+Сёмин Р. 24.12.2025 #UT10-5593
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокТранспортныхЕдиниц();
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 3);
		Возврат;
		
	КонецЕсли;
	
	Если РезультатСтруктура.Результат Тогда
		Оповестить("ОбновлениеДанных");
	КонецЕсли;
	//-Сёмин Р. 24.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаПоискаПоШК(Команда)
	
	//+Сёмин Р. 22.12.2025 #UT10-5593
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВызватьВнешнееСобытиеЗавершение", ЭтотОбъект), "", "Введите ШК");
	//-Сёмин Р. 22.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискТЕПоШК(Команда)
	
	//+Сёмин Р. 23.12.2025 #UT10-5593
	ТекДанные = Элементы.СписокТранспортныхЕдиниц.ТекущиеДанные;
	
	Если ТекДанные.Свойство("ТранспортнаяЕдиница") Тогда
		ВнешнееСобытие("", "ClipboardEvent", Элементы.СписокТранспортныхЕдиниц.ТекущиеДанные.ТранспортнаяЕдиница);
	КонецЕсли;
	//-Сёмин Р. 23.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокументыПТУ(Результат, Параметры) Экспорт 
	
	//+Сёмин Р. 22.12.2025 #UT10-5593
	 Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	РезультатСтруктура = ОбщегоНазначения.ОбработатьПроведениеДокументаПТУ(Параметры.СсылкаПТУ, Параметры.ДатаПриходаТранзит, Параметры.КоличествоМестТранзит);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(, "Ошибка: " + РезультатСтруктура.Ошибка, 4);
	Иначе
		
		ОбщегоНазначения.ЗагрузитьСписокНепроведенныхДокументовПТУ();
		Оповестить("ОбновлениеДанных");
		Закрыть();
		
	КонецЕсли;   
	//-Сёмин Р. 22.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументПТУ(Результат, Параметры) Экспорт 
	
	//+Сёмин Р. 24.12.2025 #UT10-5593
	 Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Оповестить("НайденоПТУПоТЕ", Параметры);
	Закрыть();
	//-Сёмин Р. 24.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьВнешнееСобытиеЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	//+Сёмин Р. 22.12.2025 #UT10-5593
	ВнешнееСобытие("", "Вручную", Строка);
	//-Сёмин Р. 22.12.2025 #UT10-5593
	
КонецПроцедуры

&НаСервере
Функция ПоискТЕПоШКНаСервере(Штрихкод)
	
	//+Сёмин Р. 22.12.2025 #UT10-5593
	СтруктураВозврата = Новый Структура("ТранспортнаяЕдиница,СсылкаПТУ,СтатусПриемки,НомерСкладскогоДокумента,Контрагент,ТекстСообщения,ДатаПриходаТранзит,КоличествоМестТранзит");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокТранспортныхЕдиниц.СсылкаПТУ КАК СсылкаПТУ
		|ПОМЕСТИТЬ ВТ_ПТУ
		|ИЗ
		|	РегистрСведений.СписокТранспортныхЕдиниц КАК СписокТранспортныхЕдиниц
		|ГДЕ
		|	СписокТранспортныхЕдиниц.ТранспортнаяЕдиница = &ТранспортнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТранспортныхЕдиниц.ТранспортнаяЕдиница КАК ТранспортнаяЕдиница,
		|	СписокТранспортныхЕдиниц.СсылкаПТУ КАК СсылкаПТУ,
		|	СписокТранспортныхЕдиниц.СтатусПриемки КАК СтатусПриемки,
		|	СписокТранспортныхЕдиниц.НомерСкладскогоДокумента КАК НомерСкладскогоДокумента,
		|	СписокТранспортныхЕдиниц.Контрагент КАК Контрагент
		|ИЗ
		|	РегистрСведений.СписокТранспортныхЕдиниц КАК СписокТранспортныхЕдиниц
		|ГДЕ
		|	СписокТранспортныхЕдиниц.ТранспортнаяЕдиница = &ТранспортнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТранспортныхЕдиниц.ТранспортнаяЕдиница КАК ТранспортнаяЕдиница
		|ИЗ
		|	РегистрСведений.СписокТранспортныхЕдиниц КАК СписокТранспортныхЕдиниц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПТУ КАК ВТ_ПТУ
		|		ПО СписокТранспортныхЕдиниц.СсылкаПТУ = ВТ_ПТУ.СсылкаПТУ
		|ГДЕ
		|	СписокТранспортныхЕдиниц.ТранспортнаяЕдиница <> &ТранспортнаяЕдиница
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортнаяЕдиница";
	
	Запрос.УстановитьПараметр("ТранспортнаяЕдиница", Штрихкод);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	РезультатЗапросаПТУДаннаяТЕ = РезультатЗапроса[1];
	РезультатЗапросаПТУПрочиеТЕ = РезультатЗапроса[2];
	
	Если РезультатЗапросаПТУДаннаяТЕ.Пустой() Тогда
		СтруктураВозврата.ТекстСообщения = "ТЕ по ШК " + Штрихкод + "  не найден";
	Иначе
		
		ВыборкаДетальныеЗаписиПТУДаннаяТЕ = РезультатЗапросаПТУДаннаяТЕ.Выбрать();
		ВыборкаДетальныеЗаписиПТУДаннаяТЕ.Следующий();
		
		мТекстСообщения = ("ТЕ <" + ВыборкаДетальныеЗаписиПТУДаннаяТЕ.ТранспортнаяЕдиница + "> по ПТУ № " + ВыборкаДетальныеЗаписиПТУДаннаяТЕ.НомерСкладскогоДокумента + ".");
		
		Если НЕ РезультатЗапросаПТУПрочиеТЕ.Пустой() Тогда
			
			мТекстСообщения = мТекстСообщения + Символы.ПС + "Еще ТЕ по этому ПТУ:";
			
			ВыборкаДетальныеЗаписиПТУПрочиеТЕ = РезультатЗапросаПТУПрочиеТЕ.Выбрать();
			
			Пока ВыборкаДетальныеЗаписиПТУПрочиеТЕ.Следующий() Цикл
				мТекстСообщения = мТекстСообщения + " <" + ВыборкаДетальныеЗаписиПТУПрочиеТЕ.ТранспортнаяЕдиница + ">;";
			КонецЦикла;
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ВыборкаДетальныеЗаписиПТУДаннаяТЕ);
		
		СтруктураВозврата.ТекстСообщения = мТекстСообщения;
		СтруктураВозврата.ДатаПриходаТранзит = Дата(1, 1, 1, 0, 0, 0);
		СтруктураВозврата.КоличествоМестТранзит = 0;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	//-Сёмин Р. 22.12.2025 #UT10-5593
	
КонецФункции

&НаКлиенте
Процедура СписокТранспортныхЕдиницВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//+Сёмин Р. 23.12.2025 #UT10-5593
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.СписокТранспортныхЕдиниц") Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	//-Сёмин Р. 23.12.2025 #UT10-5593
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВСписке()
	
	//+Сёмин Р. 23.12.2025 #UT10-5593
	Если Параметры.Свойство("ИсключаемыеСтатусы") Тогда
		СписокТранспортныхЕдиниц.Параметры.УстановитьЗначениеПараметра("ИсключаемыеСтатусы", Параметры.ИсключаемыеСтатусы);
	Иначе
		СписокТранспортныхЕдиниц.Параметры.УстановитьЗначениеПараметра("ИсключаемыеСтатусы", "");
	КонецЕсли;
	//-Сёмин Р. 23.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//+Сёмин Р. 21.01.2025 #UT10-5593
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();	
	КонецЕсли;
	//-Сёмин Р. 21.01.2025 #UT10-5593
	
КонецПроцедуры
